app/controllers/projects_controller.rb

INSERT INTO "projects" ("name", "description", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "java adv project"], ["description", "chukiii"], ["user_id", 1], ["created_at", "2022-10-14 07:23:36.588221"], ["updated_at", "2022-10-14 07:23:36.588221"]]
---
  def create
    @project = current_user.projects.build(project_params)

    respond_to do |format|
      if @project.save

UPDATE "projects" SET "description" = ?, "updated_at" = ? WHERE "projects"."id" = ?  [["description", "bhuuurrrrrrun"], ["updated_at", "2022-10-14 06:12:13.970714"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @project.update(project_params)

SELECT "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
DELETE FROM "projects" WHERE "projects"."id" = ?  [["id", 6]]
DELETE FROM "projects" WHERE "projects"."id" = ?  [["id", 8]]
---
  def destroy
    @project = Project.find(params[:id])
    @project.tasks.clear                   # << add this line
    @project.destroy

SELECT "projects".* FROM "projects" WHERE "projects"."user_id" = ? AND "projects"."id" = ? LIMIT ?  [["user_id", 1], ["id", 2], ["LIMIT", 1]]
---
    def set_project
      @project = current_user.projects.find(params[:id])