app/controllers/tasks_controller.rb

  def create
    @task = @project.tasks.build(task_params)

    if @task.save
---
INSERT INTO "tasks" ("name", "description", "status", "project_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "get strted"], ["description", "starting warm ups"], ["status", "started"], ["project_id", 2], ["created_at", "2022-10-14 06:30:10.101358"], ["updated_at", "2022-10-14 06:30:10.101358"]]

  def update
      if @task.update(task_params)
---
UPDATE "tasks" SET "status" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["status", "not-started"], ["updated_at", "2022-11-10 11:39:30.748257"], ["id", 9]]

    def set_project
      @project = current_user.projects.find(params[:project_id])
---
SELECT "projects".* FROM "projects" WHERE "projects"."user_id" = ? AND "projects"."id" = ? LIMIT ?  [["user_id", 1], ["id", 9], ["LIMIT", 1]]

    def set_task
      @task = @project.tasks.find(params[:id])
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."project_id" = ? AND "tasks"."id" = ? LIMIT ?  [["project_id", 2], ["id", 1], ["LIMIT", 1]]